In [1]:
import pandas as pd

In [7]:
df = pd.read_csv('./Data/biopics_csv.csv')
df.sample(5)

,title,site,country,year_release,box_office,director,number_of_subjects,subject,type_of_subject,race_known,subject_race,person_of_color,subject_sex,lead_actor_actress
284,into the wild,http://www.imdb.com/title/tt0758758/,us,2007,$18.4m,sean penn,1,christopher mccandless,athlete,unknown,NaN,0,male,emile hirsch
197,factory girl,http://www.imdb.com/title/tt0432402/,us,2006,$1.65m,george hickenlooper,1,edie sedgwick,actress,known,white,0,female,sienna miller
38,american sniper,http://www.imdb.com/title/tt2179136/,us,2014,$350m,clint eastwood,1,chris kyle,military,unknown,NaN,0,male,bradley cooper
172,dillinger,http://www.imdb.com/title/tt0037644/,us,1945,$4m,max nosseck,1,john dillinger,criminal,known,white,0,male,lawrence tierney
98,burning blue,http://www.imdb.com/title/tt1811307/,us,2013,-,"d.m.w. greer with: trent ford, tammy blanchard...",1,dmw greer,military,unknown,NaN,0,male,trent ford

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 761 entries, 0 to 760
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   title               761 non-null    object
 1   site                761 non-null    object
 2   country             761 non-null    object
 3   year_release        761 non-null    int64
 4   box_office          761 non-null    object
 5   director            761 non-null    object
 6   number_of_subjects  761 non-null    int64
 7   subject             761 non-null    object
 8   type_of_subject     761 non-null    object
 9   race_known          761 non-null    object
 10  subject_race        564 non-null    object
 11  person_of_color     761 non-null    int64
 12  subject_sex         761 non-null    object
 13  lead_actor_actress  754 non-null    object
dtypes: int64(3), object(11)
memory usage: 83.4+ KB

https://pbpython.com/currency-cleanup.html

In [10]:
df.columns

Index(['title', 'site', 'country', 'year_release', 'box_office', 'director',
       'number_of_subjects', 'subject', 'type_of_subject', 'race_known',
       'subject_race', 'person_of_color', 'subject_sex', 'lead_actor_actress'],
      dtype='object')

In [38]:
def process_data(df):
    #drop duplicate rows
    df = df.drop_duplicates()
    #change name
    df = df.rename(columns={'box_office':'earnings'})
    #remove rows where earnings are missing
    df.dropna(subset=['earnings'],inplace=True)
    #keep only movies released after 1990 or later
    df = df[df['year_release']>=1990]
    #convert type to category
    df['type_of_subject']=df['type_of_subject'].astype('category')
    df['country']=df['country'].astype('category')
    #create a new variable
    df['lead_actor_actress_known']=df['lead_actor_actress'].apply(lambda x: False if pd.isnull(x) else True)
    #update earnings in millions
    #update columns orders
    new_column_order = ['title', 'year_release','earnings','country','type_of_subject',
                        'lead_actor_actress','lead_actor_actress_known','site', 'director',
                        'number_of_subjects', 'subject', 'race_known',
                        'subject_race', 'person_of_color', 'subject_sex']
    #change column orders
    df = df.reindex(columns = new_column_order)
    df = df.sort_values(by=['earnings'],ascending = False)
    return df

In [40]:
new_df = process_data(df)

In [41]:
new_df.sample(5)

,title,year_release,earnings,country,type_of_subject,lead_actor_actress,lead_actor_actress_known,site,director,number_of_subjects,subject,race_known,subject_race,person_of_color,subject_sex
647,the prince of egypt,1998,$101m,us,historical,ralph fiennes,True,http://www.imdb.com/title/tt0120794/,"brenda chapman, steve hickner",2,ramses,known,middle eastern (white),0,male
619,the long day closes,1992,$22.8k,uk,other,leigh mccormack,True,http://www.imdb.com/title/tt0104753/,terence davies,1,terence davies,known,white,0,male
370,mesrine part 2: public enemy #1,2008,$275k,canada,criminal,vincent cassel,True,http://www.imdb.com/title/tt0411272/,jean-franois richet,1,jacques mesrine,known,white,0,male
573,the frozen ground,2013,-,us,other,nicolas cage,True,http://www.imdb.com/title/tt2005374/,scott walker,2,jack halcombe,unknown,NaN,0,male
112,captain phillips,2013,$107m,us,military,tom hanks,True,http://www.imdb.com/title/tt1535109/,paul greengrass,1,richard phillips,unknown,NaN,0,male

In [42]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 452 entries, 142 to 138
Data columns (total 15 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   title                     452 non-null    object
 1   year_release              452 non-null    int64
 2   earnings                  452 non-null    object
 3   country                   452 non-null    category
 4   type_of_subject           452 non-null    category
 5   lead_actor_actress        446 non-null    object
 6   lead_actor_actress_known  452 non-null    bool
 7   site                      452 non-null    object
 8   director                  452 non-null    object
 9   number_of_subjects        452 non-null    int64
 10  subject                   452 non-null    object
 11  race_known                452 non-null    object
 12  subject_race              328 non-null    object
 13  person_of_color           452 non-null    int64
 14  subject_sex               452 non-null    object
dtypes: bool(1), category(2), int64(3), object(9)
memory usage: 48.4+ KB

In [43]:
new_df['lead_actor_actress_known'].unique()

array([ True, False])

In [11]:
#return the max number by insert 5 to N
def solution(N):
    if N==0:
        return 50
    elif N>0:
        new_s=''
        S = str(N)
        for s in S:
            if int(s)>5:
                new_s+=s
            else:
                new_s = new_s+'5'
            
    return new_s

In [12]:
#test the result
solution(20)

'50'

In [2]:
"""Given 3 int values, a b c, return their sum. However, if one of the values is the same as
another of the values, it does not count towards the sum."""
def lone_sum(a, b, c):
  num = [a,b,c]
  if len(set(num))==1:
    return 0
  elif len(set(num))==2:
    if a==b:
      return c
    elif a==c:
      return b
    else:
      return a
  else:
    return a+b+c

In [4]:
lone_sum(3,2,3)

2

In [5]:
"""
Given 3 int values, a b c, return their sum. However, if one of the values is 13 then it 
does not count towards the sum and values to its right do not count. So for example, 
if b is 13, then both b and c do not count."""
def lucky_sum(a, b, c):
  num_list =[a, b, c]
  if 13 in num_list:
    if num_list[0]==13:
      return 0
    elif num_list[1]==13:
      return num_list[0]
    else:
      return num_list[0]+num_list[1]
  else:
    return sum(num_list)

In [6]:
lucky_sum(1, 13, 3)

1

In [8]:
"""Given 3 int values, a b c, return their sum. However, if any of the values is a teen 
-- in the range 13..19 inclusive -- then that value counts as 0, except 15 and 16 do not 
count as a teens. Write a separate helper "def fix_teen(n):"that takes in an int value and 
returns that value fixed for the teen rule. In this way, you avoid repeating the teen code 
3 times (i.e. "decomposition"). Define the helper below and at the same indent level as the
main no_teen_sum()."""
def no_teen_sum(a, b, c):
  num_list = [a, b,c]
  result = 0
  for i in num_list:
    result+=fix_teen(i)
  
  return result
  
def fix_teen(n):
  if n in range(13,20):
    if n==15 or n==16:
      return n
    else:
      return 0
  else:
    return n

In [9]:
no_teen_sum(2, 13, 1)

3

In [12]:
"""
For this problem, we'll round an int value up to the next multiple of 10 if its rightmost 
digit is 5 or more, so 15 rounds up to 20. Alternately, round down to the previous multiple 
of 10 if its rightmost digit is less than 5, so 12 rounds down to 10. Given 3 ints, a b c, 
return the sum of their rounded values. To avoid code repetition, write a separate helper 
"def round10(num):" and call it 3 times. Write the helper entirely below and at the same 
indent level as round_sum()."""
def round_sum(a, b, c):
  num_list = [a, b, c]
  result = 0
  for i in num_list:
    result +=round10(i)
  return result
  
  
def round10(num):
  if num%10>=5:
    return (num//10+1)*10
  else:
    return (num//10)*10

In [13]:
round_sum(12, 13, 14)

30

In [16]:
"""Given three ints, a b c, return True if one of b or c is "close" (differing from a by at 
most 1), while the other is "far", differing from both other values by 2 or more. 
Note: abs(num) computes the absolute value of a number."""
def close_far(a, b, c):
  if abs(b-a) >1 and abs(c-a)>1:
    return False
  elif abs(b-a)==1 and abs(b-c)>=2 and abs(c-a)>=2:
    return True
  elif abs(c-a)==1 and abs(b-c)>=2 and abs(b-a)>=2:
      return True
  else:
    return False

In [17]:
abs(3-5)

2

In [19]:
"""We want make a package of goal kilos of chocolate. We have small bars (1 kilo each) 
and big bars (5 kilos each). Return the number of small bars to use, assuming we always 
use big bars before small bars. Return -1 if it can't be done."""
def make_chocolate(small, big, goal):
  if goal-big*5==0:
    return 0
  elif goal-big*5>0 and goal-big*5<=small:
    return goal-big*5
  elif big*5>goal:
    if goal%5>small:
      return -1
    else:
      return goal%5
  else:
    return -1

In [22]:
"""Given a string, return a string where for every char in the original, there are two chars."""
def double_char(str):
  result=''
  for s in str:
    result +=2*s
  return result

In [23]:
double_char('The')

'TThhee'

In [24]:
"""Return the number of times that the string "hi" appears anywhere in the given string"""
def count_hi(str):
  count_num = str.count('hi')
  return count_num

In [25]:
count_hi('Hi is no HI on ahI')

0

In [ ]:
"""Return True if the string "cat" and "dog" appear the same number of times in the given string."""
def cat_dog(str):
  count_dog = str.count('dog')
  count_cat = str.count('cat')
  if count_dog == count_cat:
    return True
  else:
    return False

In [26]:
"""Return the number of times that the string "code" appears anywhere in the given string, 
except we'll accept any letter for the 'd', so "cope" and "cooe" count."""

def count_code(str):
  count_code = 0
  for i in range(len(str)-3):
    if str[i]=='c' and str[i+1]=='o' and str[i+3]=='e':
      count_code+=1
    else:
      count_code+=0
  return count_code

In [27]:
count_code('AAcodeBBcoleCCccoreDD')

3

In [28]:
"""
Given two strings, return True if either of the strings appears at the very end of the 
other string, ignoring upper/lower case differences (in other words, the computation should 
not be "case sensitive"). Note: s.lower() returns the lowercase version of a string.
"""

def end_other(a, b):
  if len(a)>=len(b) and a[-len(b):].lower()==b.lower():
      return True
  elif len(a)<len(b) and b[-len(a):].lower()==a.lower():
      return True
  else:
    return False

In [29]:
end_other('ab', 'ab12')

False

In [35]:
"""
Return True if the given string contains an appearance of "xyz" where the xyz is not 
directly preceeded by a period (.). So "xxyz" counts but "x.xyz" does not.
"""
def xyz_there(str):
  return 'xyz' in str.replace(".xyz", "")

In [36]:
xyz_there('abcxyz')

True